pavellzubkov/jscan_esp/sdkconfig.defaults
# Целевые дефолты конфигурации сборки jscan_esp (ESP-IDF 6.1, чип ESP32-S3)
# Плата: ESP32-S3 N16R8 — флеш 16MB (N16), PSRAM 8MB Octal SPI (R8).
# Сверены с рабочим sdkconfig; остальные опции — дефолты IDF.

CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_new.csv"

# OTA: bootloader откатывается на прошлое приложение, если новое не запустилось
# (esp_ota_mark_app_valid_cancel_rollback() в app_main подтверждает успешный старт).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# WebSocket (WsHandler/StaticHandler используют httpd_ws_* API esp_http_server).
CONFIG_HTTPD_WS_SUPPORT=y

# PSRAM 8MB (Octal SPI) модуля N16R8.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y